# -*- coding: utf-8 -*-
from enum import Enum


class Emoji(Enum):
    """Enum-клас для зберігання емоджі"""

    EMPTY = "⬜"
    ENEMY = "👹"
    ITEM = "💎"
    HERO = "🧙"
    EXIT = "🚪"
    TOMB = "💀"
    GOLD = "💵"
    BOOK = "📖"
    HEART = "❤️"
    BACK = "◀️"
    DUNG = "🗺️"
    RESP = "🔄"
    X = "❌"
    SHIELD = "🛡️"
    WEAPON = "🗡️"
    LOG = "📜"
    LEGEND = "📋"
    MOVE_Q = "↖️"
    MOVE_W = "⬆️"
    MOVE_E = "↗️"
    MOVE_A = "⬅️"
    MOVE_D = "➡️"
    MOVE_Z = "↙️"
    MOVE_S = "⬇️"
    MOVE_C = "↘️"
    CTRL = "🎮"
    CHECK = "✅"
    TRASH = "🗑️"
    SAVE = "💾"
    LOAD = "📂"
    REG = "📝"
    LOGIN = "🔐"
    PROFILE = "👤"
    KEY = "🗝️"
    PLUS = "➕"
    LOGOUT = "🔚"
    RELOAD = "↩️"
    MAN = "🧑"
    WOMEN = "👩"


TRANSLATIONS = {
    "Strength": "Сила",
    "Dexterity": "Спритність",
    "Constitution": "Статура",
    "Intelligence": "Інтелект",
    "Charisma": "Харизма",
}

MALE_NAMES = (
    "Андрій",
    "Артем",
    "Антон",
    "Адам",
    "Адріян",
    "Богдан",
    "Борис",
    "Вадим",
    "Валентин",
    "Валерій",
    "Василь",
    "Віктор",
    "Віталій",
    "Владислав",
    "Володимир",
    "В'ячеслав",
    "Гаврило",
    "Гнат",
    "Григорій",
    "Данило",
    "Денис",
    "Дмитро",
    "Євген",
    "Єлисей",
    "Єремій",
    "Єрофій",
    "Ждан",
    "Захар",
    "Зіновій",
    "Іван",
    "Ігор",
    "Ілля",
    "Йосип",
    "Кирило",
    "Клим",
    "Костянтин",
    "Леонід",
    "Лук'ян",
    "Леон",
    "Лев",
    "Максим",
    "Марко",
    "Матвій",
    "Михайло",
    "Мирон",
    "Мирослав",
    "Микита",
    "Микола",
    "Назар",
    "Олександр",
    "Олег",
    "Омелян",
    "Орест",
    "Остап",
    "Павло",
    "Петро",
    "Пилип",
    "Платон",
    "Прохор",
    "Роман",
    "Ростислав",
    "Руслан",
    "Сава",
    "Святослав",
    "Семен",
    "Сергій",
    "Сильвестр",
    "Соломон",
    "Степан",
    "Тарас",
    "Тиміш",
    "Тимофій",
    "Теодор",
    "Федір",
    "Федот",
    "Франко",
    "Христофор",
    "Юліан",
    "Юрій",
    "Яків",
    "Ян",
    "Ярема",
    "Ярослав",
    "Всеволод",
    "Володислав",
    "Овдій",
    "Арсен",
    "Арсеній",
    "Гордій",
    "Євстахій",
    "Мефодій",
    "Панас",
    "Онисим",
    "Мартин",
    "Опанас",
    "Дем'ян",
    "Самійло",
    "Мирослав",
    "Давид",
    "Охрім",
)

FEMALE_NAMES = (
    "Аліна",
    "Анастасія",
    "Ангеліна",
    "Анна",
    "Антоніна",
    "Богдана",
    "Броніслава",
    "Валентина",
    "Валерія",
    "Варвара",
    "Василина",
    "Вікторія",
    "Віра",
    "Галина",
    "Ганна",
    "Горислава",
    "Дарина",
    "Діана",
    "Домна",
    "Єва",
    "Євдокія",
    "Єлизавета",
    "Євгенія",
    "Жанна",
    "Злата",
    "Зоряна",
    "Зінаїда",
    "Іванна",
    "Інна",
    "Ірина",
    "Катерина",
    "Квітослава",
    "Ксенія",
    "Калина",
    "Лариса",
    "Леся",
    "Лідія",
    "Ліля",
    "Любава",
    "Любов",
    "Людмила",
    "Марина",
    "Марія",
    "Марта",
    "Меланія",
    "Мирослава",
    "Надія",
    "Наталія",
    "Ніна",
    "Оксана",
    "Олеся",
    "Олена",
    "Ольга",
    "Ореста",
    "Пелагея",
    "Поліна",
    "Раїса",
    "Роксолана",
    "Руслана",
    "Сабіна",
    "Світлана",
    "Сніжана",
    "Соломія",
    "Софія",
    "Стефанія",
    "Таїсія",
    "Тамара",
    "Тетяна",
    "Уляна",
    "Устина",
    "Феодосія",
    "Христина",
    "Юлія",
    "Юстина",
    "Яна",
    "Ярина",
    "Ярослава",
    "Віолета",
    "Євфросинія",
    "Орися",
    "Ілона",
    "Люцина",
    "Владислава",
    "Мелітена",
    "Вірая",
    "Мотря",
    "Євсевія",
    "Злата",
    "Дарія",
    "Меланка",
    "Ксеня",
    "Ірма",
    "Ягода",
    "Владлена",
    "Олесяна",
    "Мирка",
    "Рада",
    "Софронія",
)
